
Функция СведенияОВнешнейОбработке() Экспорт 
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.РаботаВВыходныеИПраздничныеДни");
	
	ПараметрыРегистрации.Вставить("Вид","ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение",МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование","ВПФ Работе в выходной и праздничный день");
	ПараметрыРегистрации.Вставить("Версия","1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Истина);
	ПараметрыРегистрации.Вставить("Информация","ВПФ Работе в выходной и праздничный день");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,	"Приказ о работе в выходной и праздничный день (с логотипом)", "ВПФ_MXL_ПриказОРаботеВВыходнойИПраздничныйДень", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ДобавитьКоманду(ТаблицаКоманд,	"Приказ о выплате за работу в выходной день (с логотипом)ТКС", "ВПФ_MXL_ПриказОбОплатеЗаРаботуВВыходнойИПраздничныйДень", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ДобавитьКоманду(ТаблицаКоманд,	"Приказ о привлечении к работе в выходной день (с логотипом)ТКС", "ВПФ_MXL_ПриказОПривлеченииКРаботеВВыходнойДень", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды; 
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ПараметрыПечати = Неопределено) Экспорт
	
	ПараметрыПечати = Новый Структура;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВПФ_MXL_ПриказОРаботеВВыходнойИПраздничныйДень") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВПФ_MXL_ПриказОРаботеВВыходнойИПраздничныйДень",
		НСтр("ru = 'Приказ о работе в выходной и праздничный день (с логотипом)';
		|en = 'Transfer note'"),
		ПечатнаяФормаПриказаОРаботеВВыходнойИПраздничныйДень(МассивОбъектов[0], ОбъектыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВПФ_MXL_ПриказОбОплатеЗаРаботуВВыходнойИПраздничныйДень") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВПФ_MXL_ПриказОбОплатеЗаРаботуВВыходнойИПраздничныйДень",
		НСтр("ru = 'Приказ о выплате за работу в выходной день (с логотипом)ТКС';
		|en = 'Transfer note'"),
		СформироватьПриказОбОплатеЗаРаботуВВыходнойИПраздничныйДень(МассивОбъектов[0], ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВПФ_MXL_ПриказОПривлеченииКРаботеВВыходнойДень") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВПФ_MXL_ПриказОПривлеченииКРаботеВВыходнойДень",
		НСтр("ru = 'Приказ о привлечении к работе в выходной день (с логотипом)ТКС';
		|en = 'Transfer note'"),
		СформироватьПриказОРаботеВВыходнойИПраздничныйДеньТКС(МассивОбъектов[0], ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатнаяФормаПриказаОРаботеВВыходнойИПраздничныйДень(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказОРаботеВВыходнойИПраздничныйДень";
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет("ВПФ_MXL_ПриказОРаботеВВыходнойИПраздничныйДень");
	
	Если МассивОбъектов.Организация.ИНН = "2130184747" Тогда
		ОбластьКартинки = Макет.ПолучитьОбласть("ТКН");
	Иначе
		ОбластьКартинки = Макет.ПолучитьОбласть("ТКП");	
	КонецЕсли;	
	ОбластьШапка 	  = Макет.ПолучитьОбласть("Шапка");
	ОбластьДатаРаботы = Макет.ПолучитьОбласть("ДатаРаботы");
	ОбластьРаботник   = Макет.ПолучитьОбласть("Работник");
	ОбластьПодвал 	  = Макет.ПолучитьОбласть("Подвал");
	ОбластьОзнакомлен = Макет.ПолучитьОбласть("Ознакомлен");
	
	ТабДокумент.Вывести(ОбластьКартинки);
	
	ДанныеДляПечати = ДанныеДляПечатиПриказаОРаботеВВыходнойИПраздничныйДень(МассивОбъектов);
	
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоСтрокам 	= ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаСотрудники = Новый ТаблицаЗначений;
	ТаблицаСотрудники.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаСотрудники.Колонки.Добавить("ФИО", Новый ОписаниеТипов("Строка"));
	ТаблицаСотрудники.Колонки.Добавить("Должность", Новый ОписаниеТипов("Строка"));
	ТаблицаСотрудники.Колонки.Добавить("ДатаДок", Новый ОписаниеТипов("Дата"));
	
	Пока ВыборкаПоДокументам.Следующий() Цикл  
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		НомерПункта = 0;
		ТаблицаСотрудники.Очистить();
		
		Параметры = ПолучитьСтруктуруПараметровПриказаОРаботеВВыходнойИПраздничныйДень();
		КадровыйУчет.ЗаполнитьПараметрыКадровогоПриказа(Параметры, ВыборкаПоДокументам);
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Параметры);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, Параметры);
		
		ОбластьШапка.Параметры.ДатаДок  = Формат(Параметры.ДатаДок, "ДЛФ=D");
		ОбластьШапка.Параметры.НомерДок = МассивОбъектов.ASTRAНомерДляПечати;
		ТабДокумент.Вывести(ОбластьШапка);
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка);
		
		ВыборкаПоСтрокам.Сбросить();
		
		Пока ВыборкаПоСтрокам.НайтиСледующий(СтруктураПоиска) Цикл 
			
			ВыборкаПоДатам = ВыборкаПоСтрокам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоДатам.Следующий() Цикл 
				
				НомерПункта = НомерПункта + 1;
				
				ОбластьДатаРаботы.Параметры.НомерПункта = НомерПункта;
				ОбластьДатаРаботы.Параметры.ДатаРаботы = Формат(ВыборкаПоДатам.Дата, "ДЛФ=ДД");
				
				ТабДокумент.Вывести(ОбластьДатаРаботы);
				
				ВыборкаПоСотрудникам = ВыборкаПоДатам.Выбрать();
				
				Пока ВыборкаПоСотрудникам.Следующий() Цикл 
					
					ДанныеСтроки = Новый Структура;
					ДанныеСтроки.Вставить("Сотрудник", ВыборкаПоСотрудникам.Сотрудник);
					ДанныеСтроки.Вставить("ФИО", ВыборкаПоСотрудникам.Сотрудник);
					ДанныеСтроки.Вставить("Должность", ВыборкаПоСотрудникам.Должность);
					
					ЗаполнитьЗначенияСвойств(ОбластьРаботник.Параметры, ДанныеСтроки);
					ОбластьРаботник.Параметры.Код = ВыборкаПоСотрудникам.Сотрудник.Код;	
					ТабДокумент.Вывести(ОбластьРаботник);
					
					Если ТаблицаСотрудники.Найти(ВыборкаПоСотрудникам.Сотрудник, "Сотрудник") = Неопределено Тогда 
						ДанныеСтроки.Вставить("ФИО", ВыборкаПоСотрудникам.ИОФамилия);
						НоваяСтрока = ТаблицаСотрудники.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.НомерПункта1 = НомерПункта + 1;
		ОбластьПодвал.Параметры.НомерПункта2 = НомерПункта + 2;
		
		ТабДокумент.Вывести(ОбластьПодвал);
		
		ТаблицаСотрудники.Сортировать("ФИО");
		ТаблицаСотрудники.ЗаполнитьЗначения(ВыборкаПоДокументам.ДатаДок, "ДатаДок");
		
		Для Каждого ТекСтрока Из ТаблицаСотрудники Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьОзнакомлен.Параметры, ТекСтрока);
			ТабДокумент.Вывести(ОбластьОзнакомлен);
		КонецЦикла;
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции	

Функция ДанныеДляПечатиПриказаОРаботеВВыходнойИПраздничныйДень(МассивОбъектов)
	
	// Запрос по шапкам документов.
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Причина КАК Причина,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ДанныеДокумента.Организация.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ДанныеДокумента.Организация.Наименование
	|		ИНАЧЕ ДанныеДокумента.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НазваниеОрганизации,
	|	ДанныеДокумента.СогласиеТребуется КАК СогласиеТребуется,
	|	ДанныеДокумента.Руководитель КАК Руководитель,
	|	ДанныеДокумента.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ДанныеДокумента.ASTRAНомерДляПечати КАК ASTRAНомерДляПечати
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.РаботаВВыходныеИПраздничныеДни КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.Выполнить();
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("Руководитель");
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Ложь, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументов");
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Номер КАК НомерДок,
	|	ДанныеДокументов.Дата КАК ДатаДок,
	|	ДанныеДокументов.Причина КАК Причина,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.СогласиеТребуется КАК СогласиеТребуется,
	|	ДанныеДокументов.НазваниеОрганизации КАК НазваниеОрганизации,
	|	ДанныеДокументов.ДолжностьРуководителя.Наименование КАК ДолжностьРуководителя,
	|	ФИООтветственныхЛиц.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИООтветственныхЛиц
	|		ПО ДанныеДокументов.Руководитель = ФИООтветственныхЛиц.ФизическоеЛицо
	|			И ДанныеДокументов.Ссылка = ФИООтветственныхЛиц.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("РезультатПоШапке", РезультатЗапроса);
	
	// Запрос по табличным частям
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Дата КАК Дата,
	|	Сотрудники.Ссылка.Дата КАК Период
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивОбъектов)
	|	И (НЕ ВЫРАЗИТЬ(Сотрудники.Ссылка КАК Документ.РаботаВВыходныеИПраздничныеДни).ВремяВЧасах
	|				И НЕ Сотрудники.НеРаботал
	|			ИЛИ ВЫРАЗИТЬ(Сотрудники.Ссылка КАК Документ.РаботаВВыходныеИПраздничныеДни).ВремяВЧасах
	|				И Сотрудники.ОтработаноЧасов > 0)";
	
	Запрос.Выполнить();			   
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТДанныеДокументов");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "ФамилияИО,ИОФамилия,Должность");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Дата КАК Дата,
	|	ДанныеДокументов.Сотрудник КАК Сотрудник,
	|	КадровыеДанныеСотрудников.Должность.Наименование КАК Должность,
	|	КадровыеДанныеСотрудников.ФамилияИО КАК ФамилияИО,
	|	КадровыеДанныеСотрудников.ИОФамилия КАК ИОФамилия
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО ДанныеДокументов.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|			И ДанныеДокументов.Период = КадровыеДанныеСотрудников.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Дата,
	|	КадровыеДанныеСотрудников.ФамилияИО
	|ИТОГИ ПО
	|	Ссылка,
	|	Дата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляПечати.Вставить("РезультатПоТабличнойЧасти", РезультатЗапроса);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ПолучитьСтруктуруПараметровПриказаОРаботеВВыходнойИПраздничныйДень()
	
	Параметры = КадровыйУчет.ПараметрыКадровогоПриказа();
	
	Параметры.Вставить("Причина");
	
	Возврат Параметры;
	
КонецФункции 

Функция СформироватьПриказОРаботеВВыходнойИПраздничныйДеньТКС(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РаботаВВыходныеИПраздничныеДни";
	Макет = ПолучитьМакет("ВПФ_MXL_ПриказОПривлеченииКРаботеВВыходнойДень");
	
	ОбластьКартинки = Макет.ПолучитьОбласть("ТКС");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицыСотрудников = Макет.ПолучитьОбласть("ШапкаТаблицыСотрудников");	
	ОбластьРаботник = Макет.ПолучитьОбласть("ОбластьРаботник");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПункт1 = Макет.ПолучитьОбласть("Пункт1"); 
	ОбластьПункт2 = Макет.ПолучитьОбласть("Пункт2");
	ОбластьПункт3 = Макет.ПолучитьОбласть("Пункт3");
	ОбластьПункт4 = Макет.ПолучитьОбласть("Пункт4");
	ОбластьПункт5 = Макет.ПолучитьОбласть("Пункт5");  
	ОбластьПункт6 = Макет.ПолучитьОбласть("Пункт6");
	ОбластьПункт7 = Макет.ПолучитьОбласть("Пункт7");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьОзнакомление = Макет.ПолучитьОбласть("Ознакомление");
	ОбластьОзнакомлениеСотрудники = Макет.ПолучитьОбласть("ОзнакомлениеСотрудники");            
	ОбластьУведомление = Макет.ПолучитьОбласть("Уведомление");
	ОбластьСотрудникУв = Макет.ПолучитьОбласть("СотрудникУв");
	
	ТабДокумент.Вывести(ОбластьКартинки);
	
	ОбластьШапка.Параметры.ДатаДок = Формат(МассивОбъектов.Дата,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДок = МассивОбъектов.Номер;
	Если ЗначениеЗаполнено(МассивОбъектов.Причина) тогда
		Причина = МассивОбъектов.Причина;
	Иначе 
		Причина = "Для выполнения неотложных работ с целью надежной и бесперебойной работы производственного процесса, соблюдения технологических операций по уходу за растениями и в соответствии со ст. 113 и ст. 153 Трудового кодекса РФ";	
	КонецЕсли;
	ОбластьШапка.Параметры.Причина = Причина;
	ТабДокумент.Вывести(ОбластьШапка);	
	
	ВыборкаДетальныеЗаписи = ПолучитьСотрудниковИзДокумента(МассивОбъектов);
	
	СписокДат = Новый СписокЗначений;
	
	НомерПункта = 1;
	
	ДанныеДляПечатиТаблиц = новый Массив;
	НайдСтроки = ВыборкаДетальныеЗаписи.НайтиСтроки(Новый Структура ("СпособКомпенсацииПереработки", Перечисления.СпособыКомпенсацииПереработки.ПовышеннаяОплата));
	Если НайдСтроки.Количество() > 0 Тогда
		ДанныеДляПечатиТаблиц.Добавить(НайдСтроки); 
	КонецЕсли;
	НайдСтроки = ВыборкаДетальныеЗаписи.НайтиСтроки(Новый Структура ("СпособКомпенсацииПереработки", Перечисления.СпособыКомпенсацииПереработки.Отгул));
	Если НайдСтроки.Количество() > 0 Тогда
		ДанныеДляПечатиТаблиц.Добавить(НайдСтроки); 
	КонецЕсли;	
	Для каждого НайденныеСтроки из ДанныеДляПечатиТаблиц Цикл
		Если НайденныеСтроки.Количество() > 0 Тогда  
			НомерПП = 1;
			ОбластьШапкаТаблицыСотрудников.Параметры.НомерПункта = НомерПункта;
			ОбластьШапкаТаблицыСотрудников.Параметры.Подразделение = Нрег(ПолучитьСклоненияСтроки(НайденныеСтроки[0].Подразделение, ,"ПД=Родительный")[0]);
			Если НайденныеСтроки[0].СпособКомпенсацииПереработки = Перечисления.СпособыКомпенсацииПереработки.ПовышеннаяОплата Тогда 
				ОбластьШапкаТаблицыСотрудников.Параметры.ВидОплаты = "двойном размере";
			Иначе
				ОбластьШапкаТаблицыСотрудников.Параметры.ВидОплаты = "одинарном размере с предоставлением дополнительных дней отдыха";
			КонецЕсли;
			НомерПункта = НомерПункта + 1;
			ТабДокумент.Вывести(ОбластьШапкаТаблицыСотрудников);
			Для каждого стр из НайденныеСтроки Цикл
				ВыборкаДетальныеЗаписи2 = ПолучитьСотрудникиТабличнаяЧастьПериод(МассивОбъектов, стр.Сотрудник, стр.ОтработаноЧасов, стр.СпособКомпенсацииПереработки);
				Для каждого выборка из ВыборкаДетальныеЗаписи2 Цикл
						СписокДат.Добавить(Формат(выборка.Период,"ДФ=dd.MM.yyyy"));	
				КонецЦикла;
				Если стр.ОтработаноЧасов > 0 ИЛИ не МассивОбъектов.ВремяВЧасах Тогда
					ОбластьРаботник.Параметры.НомерПП = НомерПП;
					ОбластьРаботник.Параметры.ФИОТКС = стр.Сотрудник;
					ОбластьРаботник.Параметры.Должность = стр.Должность;			
					ОбластьРаботник.Параметры.ТабНомер = стр.СотрудникКод;
					Если СписокДат.Количество() > 0 Тогда 
						СДТ = "";
						Для каждого дата из СписокДат Цикл	
							СДТ = СДТ + Формат(дата,"ДФ=dd.MM.yyyy") + "
							|";
						КонецЦикла;
						ОбластьРаботник.Параметры.ДатаТК = СДТ;
					КонецЕсли;
					ОбластьРаботник.Параметры.Заполнить(ОпределитьРежимРаботыСотрудников(стр.ОтработаноЧасов));  
					Если МассивОбъектов.ВремяВЧасах Тогда
						ОбластьРаботник.Параметры.КолЧасов = стр.ОтработаноЧасов;
					Иначе
						ОбластьРаботник.Параметры.КолЧасов = 8;
					КонецЕсли;
					ТабДокумент.Вывести(ОбластьРаботник);
					НомерПП = НомерПП + 1;
					СписокДат.Очистить();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;  
	
	ТабДокумент.Вывести(ОбластьПустаяСтрока);	
	ПунктКонтекст = 1;  
	
	ЕстьВидОплатыДвойной = ЛОЖЬ;
	ЕстьВидОплатыОдинарный = ЛОЖЬ;
	
	Для каждого НайденныеСтроки из ДанныеДляПечатиТаблиц Цикл
		Если НайденныеСтроки.Количество() > 0 Тогда	
			ОбластьПункт1.Параметры.НомерПункта = НомерПункта;
			ОбластьПункт1.Параметры.ПунктКонтекст = ПунктКонтекст;
			Если НайденныеСтроки[0].СпособКомпенсацииПереработки = Перечисления.СпособыКомпенсацииПереработки.ПовышеннаяОплата Тогда 
				ОбластьПункт1.Параметры.ВидОплаты = "двойном";
				ЕстьВидОплатыДвойной = Истина;
			Иначе	
				ОбластьПункт1.Параметры.ВидОплаты = "одинарном";
				ЕстьВидОплатыОдинарный = Истина; 
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьПункт1);
			ПунктКонтекст = ПунктКонтекст +1; 
			НомерПункта = НомерПункта +1;
		КонецЕсли;
	КонецЦикла;
	//Руководитель = ПолучитьРук(ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка);
	//ОбластьПункт2.Параметры.ДолжностьРук = ПолучитьСклоненияСтроки(Руководитель.ДолжностьРук, ,"ПД=Дательный")[0];  
	//Если ЗначениеЗаполнено(Руководитель.Рук) Тогда 
	//	ОбластьПункт2.Параметры.Рук = ПолучитьСклоненияСтроки(Руководитель.Рук, ,"ПД=Дательный")[0];
	//КонецЕсли;
	ОбластьПункт2.Параметры.НомерПункта = НомерПункта;	
	ТабДокумент.Вывести(ОбластьПункт2);
	
	ОбластьПункт3.Параметры.НомерПункта = НомерПункта;
	ОбластьПункт3.Параметры.МесяцПрописью = НРег(Формат(МассивОбъектов.ДатаНачалаСобытия, "ДФ=MMMM"));
	ОбластьПункт3.Параметры.Год = Формат(МассивОбъектов.ДатаНачалаСобытия, "ДФ=yyyy");
	Если ЕстьВидОплатыДвойной и не ЕстьВидОплатыОдинарный Тогда
		СтрокаКодОплаты = "«РВ» (оплата труда в двойном размере)"; 
	ИначеЕсли не ЕстьВидОплатыДвойной и ЕстьВидОплатыОдинарный Тогда
		СтрокаКодОплаты = "«ПН» (оплата труда в одинарном размере с предоставлением другого выходного дня)";
	ИначеЕсли ЕстьВидОплатыДвойной и ЕстьВидОплатыОдинарный Тогда
		СтрокаКодОплаты = "«РВ» (оплата труда в двойном размере) или «ПН» (оплата труда в одинарном размере с предоставлением другого выходного дня)";
	Иначе
		СтрокаКодОплаты = "";
	КонецЕсли;
	ОбластьПункт3.Параметры.Код = СтрокаКодОплаты;
	ТабДокумент.Вывести(ОбластьПункт3);
	
    Если ЕстьВидОплатыОдинарный Тогда 
		ОбластьПункт4.Параметры.НомерПункта = НомерПункта;  
		ТабДокумент.Вывести(ОбластьПункт4);
	КонецЕсли;
	
	ОбластьПункт5.Параметры.НомерПункта = НомерПункта;
	ДатаОзнакомления = МассивОбъектов.ДатаНачалаСобытия;
	ОбластьПункт5.Параметры.ДатаОзнакомления = Формат(ПолучитьДатуОзнакомления(ДатаОзнакомления), "ДФ=dd.MM.yyyy");
	Если ЕстьВидОплатыОдинарный Тогда
		ОбластьПункт5.Параметры.ПодПункт = 3;
	Иначе 
		ОбластьПункт5.Параметры.ПодПункт = 2;
	КонецЕсли;
	Если ЕстьВидОплатыДвойной и ЕстьВидОплатыОдинарный Тогда
		ОбластьПункт5.Параметры.ПунктКонтекст = "п.1, п.2";
	Иначе
		ОбластьПункт5.Параметры.ПунктКонтекст = "п.1";
	КонецЕсли;
	
	НомерПункта = НомерПункта +1;
	ТабДокумент.Вывести(ОбластьПункт5);
	
	ОбластьПункт6.Параметры.НомерПункта = НомерПункта;
	ОбластьПункт6.Параметры.МесяцПрописью = НРег(Формат(МассивОбъектов.ДатаНачалаСобытия, "ДФ=MMMM"));
	ОбластьПункт6.Параметры.Год = Формат(МассивОбъектов.ДатаНачалаСобытия, "ДФ=yyyy");
	
	НомерПункта = НомерПункта +1;
	ТабДокумент.Вывести(ОбластьПункт6);
	
	ОбластьПункт7.Параметры.НомерПункта = НомерПункта;

	ТабДокумент.Вывести(ОбластьПункт7);
	
	ОбластьПодвал.Параметры.ДолжностьГД = МассивОбъектов.ДолжностьРуководителя;
	ОбластьПодвал.Параметры.ГД = МассивОбъектов.Руководитель.Инициалы + МассивОбъектов.Руководитель.Фамилия;
	//Если ЗначениеЗаполнено(Руководитель.Рук) Тогда
	//	ОбластьПодвал.Параметры.Рук = ПолучитьСклоненияСтроки(Руководитель.Рук, ,"ПД=Родительный")[0];  
	//КонецЕсли; 
	ТабДокумент.Вывести(ОбластьПодвал);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ОбластьШапкаСогл = Макет.ПолучитьОбласть("ШапкаСогл"); 
	ОбластьШапкаТабСогл = Макет.ПолучитьОбласть("ШапкаТабСогл");
	ОбластьТабСогл = Макет.ПолучитьОбласть("ТабСогл");
	ОбластьШапкаОзн = Макет.ПолучитьОбласть("ШапкаОзн");
	ОбластьРазрыв = Макет.ПолучитьОбласть("Разрыв");
	
	ТабДокумент.Вывести(ОбластьШапкаСогл);
	ТабДокумент.Вывести(ОбластьШапкаТабСогл);  
	
	ОбластьТабСогл.Параметры.Заполнить(ПолучитьДанныеПоДолжности("Заместитель генерального директора по безопасности",ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка.ГоловнаяОрганизация)); 
	ТабДокумент.Вывести(ОбластьТабСогл);
    ОбластьТабСогл.Параметры.Заполнить(ПолучитьДанныеПоДолжности("Главный бухгалтер",ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка.ГоловнаяОрганизация)); 
	ТабДокумент.Вывести(ОбластьТабСогл);  
	
	                                
	РукЮрОтдела = ПолучитьРукЮРОтдела(МассивОбъектов.Руководитель);	
	ДолжностьРукЮрОтдела = ПолучитьДолжностьОтветственного(РукЮрОтдела);
	ОбластьТабСогл.Параметры.Должность = ДолжностьРукЮрОтдела;
	ОбластьТабСогл.Параметры.Сотрудник = РукЮрОтдела.Инициалы + РукЮрОтдела.Фамилия;
	
	//ОбластьТабСогл.Параметры.Заполнить(ПолучитьДанныеПоДолжности("Начальник отдела по правовым вопросам",ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка.ГоловнаяОрганизация)); 
	ТабДокумент.Вывести(ОбластьТабСогл);
	ОбластьТабСогл.Параметры.Заполнить(ПолучитьДанныеПоДолжности("Руководитель службы персонала",ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка.ГоловнаяОрганизация)); 
	ТабДокумент.Вывести(ОбластьТабСогл);
	//ОбластьТабСогл.Параметры.Заполнить(ПолучитьДанныеПоДолжности("Начальник основного производства",ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка.ГоловнаяОрганизация));
	////Тест = ПолучитьРук(ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка);
	////ОбластьТабСогл.Параметры.Заполнить(ПолучитьРук(ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка));
	////ТабДокумент.Вывести(ОбластьТабСогл);
	
	ОбластьШапкаОзн.Параметры.Дата = Формат(МассивОбъектов.Дата,"ДФ=dd.MM.yyyy");
	ОбластьШапкаОзн.Параметры.Номер = МассивОбъектов.Номер;
	
	ТабДокумент.Вывести(ОбластьШапкаОзн);
	ТабДокумент.Вывести(ОбластьШапкаТабСогл); 
	
	//ОбластьТабСогл.Параметры.Заполнить(ПолучитьДанныеПоДолжности("Ведущий бухгалтер",ДанныеДляПечатиТаблиц[0][0].ПодразделениеСсылка.ГоловнаяОрганизация));
	ОбластьТабСогл.Параметры.Должность = "Ведущий бухгалтер";
	ОбластьТабСогл.Параметры.Сотрудник = "Ю.В.Терентьева";
	ТабДокумент.Вывести(ОбластьТабСогл);
	
	СотрудникиДляОзн = ПолучитьСотрудниковДляОзнакомления(МассивОбъектов); 
	СписокСотрудников = Новый СписокЗначений;
	
	Для каждого Сотрудник из СотрудникиДляОзн Цикл
		инициалы = "";
		Для а = 1 по СтрДлина(Сотрудник.Инициалы) цикл
			Если Сред(Сотрудник.Инициалы, а, 1) <> " " Тогда
				инициалы = инициалы + Сред(Сотрудник.Инициалы, а, 1);
			КонецЕсли;
		КонецЦикла;
		СписокСотрудников.Добавить(инициалы + ПолучитьСклоненияСтроки(Сотрудник.Фамилия, , "ПД = Дательный")[0]);
		
		ОбластьТабСогл.Параметры.Должность = Сотрудник.Должность;
		ОбластьТабСогл.Параметры.Сотрудник = Сотрудник.Инициалы + Сотрудник.Фамилия;
		ТабДокумент.Вывести(ОбластьТабСогл);
	КонецЦикла; 
	
	ТабДокумент.Вывести(ОбластьРазрыв);

    ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////			
	ТабДокумент.Вывести(ОбластьКартинки);
	
	////Орёл
	ОбластьУведомление.Параметры.Сотрудник123 = СписокСотрудников; 
	ОбластьУведомление.Параметры.Подразделение = СокрЛП(НРег(ПолучитьСклоненияСтроки(ДанныеДляПечатиТаблиц[0][0].Подразделение, , "ПД = Родительный")[0]));	
	ДатаУв = ПолучитьДатыРаботы (МассивОбъектов);
	Для каждого Дата из ДатаУв Цикл
		СписокДат.Добавить(Формат(Дата[0],"ДФ=dd.MM.yyyy"));
	КонецЦикла;
	ОбластьУведомление.Параметры.Причина = Причина;	
	ОбластьУведомление.Параметры.СписокДат = СписокДат;
	ОбластьУведомление.Параметры.ДатаУв = Формат(МассивОбъектов.Дата, "ДЛФ=DD");
	ОбластьУведомление.Параметры.Ответственный = МассивОбъектов.Ответственный.ФизическоеЛицо.Инициалы + " " + МассивОбъектов.Ответственный.ФизическоеЛицо.Фамилия;
	ОбластьУведомление.Параметры.ОтветственныйДолжность = ПолучитьДолжностьОтветственного(МассивОбъектов.Ответственный.ФизическоеЛицо); 
	
	ТабДокумент.Вывести(ОбластьУведомление);
	
	Для каждого Сотрудник из СотрудникиДляОзн Цикл	
		ОбластьСотрудникУв.Параметры.СотрУв = Сотрудник.Инициалы + " " + Сотрудник.Фамилия;
		ТабДокумент.Вывести(ОбластьСотрудникУв);	
	КонецЦикла;	
	
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПриказОбОплатеЗаРаботуВВыходнойИПраздничныйДень(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РаботаВВыходныеИПраздничныеДни";
	Макет = ПолучитьМакет("ВПФ_MXL_ПриказОбОплатеЗаРаботуВВыходнойИПраздничныйДень");
	
	ОбластьКартинки     = Макет.ПолучитьОбласть("ТКС");
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	ОбластьОзнакомление = Макет.ПолучитьОбласть("Ознакомление");
	ОбластьСотрудникОЗ  = Макет.ПолучитьОбласть("СотрудникОЗ");
	ТабДокумент.Вывести(ОбластьКартинки);
	
	ОбластьШапка.Параметры.ДатаДок  =  Формат(МассивОбъектов.Дата,"ДЛФ=DD");
	ОбластьШапка.Параметры.НомерДок =  МассивОбъектов.Номер;
	ОбластьШапка.Параметры.Причина  =  МассивОбъектов.Причина;
	ТабДокумент.Вывести(ОбластьШапка);
	
	МассивДР        = Новый Массив;
	МассивОРПДВ     = Новый Массив;
	МассивФактДР    = Новый Массив;
	МассивФактОРПДВ = Новый Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Период КАК Дата,
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Часы КАК Часы,
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.ВидУчетаВремени КАК СпособКомпенсации,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников КАК ДанныеОперативногоУчетаРабочегоВремениСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|		ПО ДанныеОперативногоУчетаРабочегоВремениСотрудников.Сотрудник = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Сотрудник,
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Период,
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Часы,
	|	ДанныеОперативногоУчетаРабочегоВремениСотрудников.ВидУчетаВремени,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность";
	
	Запрос.УстановитьПараметр("Регистратор", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураИзменеия = Новый Структура("Дата,Сотрудник,ТабНомер,Часы,СпособКомпенсации,Должность");
		ЗаполнитьЗначенияСвойств(СтруктураИзменеия, ВыборкаДетальныеЗаписи);
		
		Если  ВыборкаДетальныеЗаписи.Должность = Справочники.Должности.НайтиПоНаименованию("Овощевод") И ВыборкаДетальныеЗаписи.СпособКомпенсации = Справочники.ВидыИспользованияРабочегоВремени.Праздники Тогда	
			МассивДР.Добавить(СтруктураИзменеия);
		ИначеЕсли ВыборкаДетальныеЗаписи.Должность = Справочники.Должности.НайтиПоНаименованию("Овощевод") И ВыборкаДетальныеЗаписи.СпособКомпенсации = Справочники.ВидыИспользованияРабочегоВремени.ПраздникиБезПовышеннойОплаты Тогда
			МассивОРПДВ.Добавить(СтруктураИзменеия);
		ИначеЕсли ВыборкаДетальныеЗаписи.Должность <> Справочники.Должности.НайтиПоНаименованию("Овощевод") И ВыборкаДетальныеЗаписи.СпособКомпенсации = Справочники.ВидыИспользованияРабочегоВремени.Праздники Тогда
			МассивФактДР.Добавить(СтруктураИзменеия);
		ИначеЕсли ВыборкаДетальныеЗаписи.Должность <> Справочники.Должности.НайтиПоНаименованию("Овощевод") И ВыборкаДетальныеЗаписи.СпособКомпенсации = Справочники.ВидыИспользованияРабочегоВремени.ПраздникиБезПовышеннойОплаты Тогда
			МассивФактОРПДВ.Добавить(СтруктураИзменеия);	
		КонецЕсли;
		
	КонецЦикла;
	
	
	//Двойной размер оплаты только (овощеводы)
	
	Если МассивДР.Количество() > 0 Тогда
		
		ТабЗначДРСотрудник = Новый ТаблицаЗначений;
		Для Каждого ЭлементМассива Из МассивДР Цикл
			Если ТабЗначДРСотрудник.Колонки.Количество() = 0 Тогда
				Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
					ТабЗначДРСотрудник.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
				КонецЦикла;
			КонецЕсли;
			НоваяСтрока = ТабЗначДРСотрудник.Добавить();
			Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
				НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
			КонецЦикла;
		КонецЦикла;
		МассивДРСотрудник = Новый Массив;
		МассивДРСотрудник.Добавить(ТабЗначДРСотрудник.ВыгрузитьКолонку("Сотрудник"));
		
		ОбластьДвойнойРазмер           = Макет.ПолучитьОбласть("ДвойнойРазмер");
		ТабДокумент.Вывести(ОбластьДвойнойРазмер);
		ОбластьСотрудникиДвойнойРазмер = Макет.ПолучитьОбласть("СотрудникиДвойнойРазмер");
		
		ЗапросСотрудников = Новый Запрос;
		ЗапросСотрудников.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник КАК Сотрудник,
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.Код КАК СотрудникКод,
		|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК РаботаВВыходныеИПраздничныеДниСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
		|		ПО РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.Ссылка = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка = &Ссылка
		|	И РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник В(&МассивДР)";
		ЗапросСотрудников.УстановитьПараметр("Ссылка",МассивОбъектов);
		ЗапросСотрудников.УстановитьПараметр("МассивДР",МассивДРСотрудник[0]);
		РезультатЗапросаСотрудники = ЗапросСотрудников.Выполнить();
		ВыборкаДетальныеЗаписиСотрудников = РезультатЗапросаСотрудники.Выбрать();
		
		СписокДат = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписиСотрудников.Следующий() Цикл
			Для каждого Элемент Из МассивДР Цикл
				Если ВыборкаДетальныеЗаписиСотрудников.Сотрудник = Элемент.Сотрудник Тогда
					СписокДат.Добавить(Формат(Элемент.Дата,"ДФ=dd.MM.yyyy"));
				КонецЕсли;
			КонецЦикла;
			
			ОбластьСотрудникиДвойнойРазмер.Параметры.ДолжностьДР    = ВыборкаДетальныеЗаписиСотрудников.Должность;
			ОбластьСотрудникиДвойнойРазмер.Параметры.ФИОработникаДР = ВыборкаДетальныеЗаписиСотрудников.Сотрудник;
			ОбластьСотрудникиДвойнойРазмер.Параметры.КодДР          = ВыборкаДетальныеЗаписиСотрудников.СотрудникКод;
			ОбластьСотрудникиДвойнойРазмер.Параметры.ДатаДР         = СписокДат;
			ТабДокумент.Вывести(ОбластьСотрудникиДвойнойРазмер);
			СписокДат.Очистить();
			
		КонецЦикла;
	КонецЕсли;
	
	
	//одинарный размер оплаты + выходной в другой день только (овощеводы)
	
	Если МассивОРПДВ.Количество() > 0 Тогда
		
		ТабЗначОРПДВ = Новый ТаблицаЗначений;
		Для Каждого ЭлементМассива Из МассивОРПДВ Цикл
			Если ТабЗначОРПДВ.Колонки.Количество() = 0 Тогда
				Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
					ТабЗначОРПДВ.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
				КонецЦикла;
			КонецЕсли;
			НоваяСтрока = ТабЗначОРПДВ.Добавить();
			Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
				НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
			КонецЦикла;
		КонецЦикла;
		МассивОРПДВСотрудник = Новый Массив;
		МассивОРПДВСотрудник.Добавить(ТабЗначОРПДВ.ВыгрузитьКолонку("Сотрудник"));
		
		ОбластьОдинРазПредДрВых        = Макет.ПолучитьОбласть("ОдинРазПредДрВых");
		ТабДокумент.Вывести(ОбластьОдинРазПредДрВых);
		ОбластьСотрудникиОРПДВ         = Макет.ПолучитьОбласть("СотрудникиОРПДВ");
		
		ЗапросОРПДВ = Новый Запрос;
		ЗапросОРПДВ.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК РаботаВВыходныеИПраздничныеДниСотрудники
		|ГДЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка = &Ссылка
		|	И РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник В(&МассивОРПДВСотрудник)";
		ЗапросОРПДВ.УстановитьПараметр("Ссылка",МассивОбъектов);
		ЗапросОРПДВ.УстановитьПараметр("МассивОРПДВСотрудник",МассивОРПДВСотрудник[0]);
		РезультатЗапросаОРПДВ = ЗапросОРПДВ.Выполнить();
		ВыборкаДетальныеЗаписиОРПДВ = РезультатЗапросаОРПДВ.Выбрать();
		
		СписокДатОРПДВ = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписиОРПДВ.Следующий() Цикл
			Для каждого Элемент Из МассивОРПДВ Цикл
				Если ВыборкаДетальныеЗаписиОРПДВ.Сотрудник = Элемент.Сотрудник Тогда
					СписокДатОРПДВ.Добавить(Формат(Элемент.Дата,"ДФ=dd.MM.yyyy"));
				КонецЕсли;
			КонецЦикла;
			
			ОбластьСотрудникиОРПДВ.Параметры.ФИОработникаОРПДВ = ВыборкаДетальныеЗаписиОРПДВ.Сотрудник;	
			ОбластьСотрудникиОРПДВ.Параметры.ДатаОРПДВ         = СписокДатОРПДВ;
			ТабДокумент.Вывести(ОбластьСотрудникиОРПДВ);
			СписокДатОРПДВ.Очистить();	
		КонецЦикла;	
	КонецЕсли;
	
	
	//одинарный размер оплаты + выходной в другой день (все кроме овощеводов)
	
	
	Если МассивФактОРПДВ.Количество() > 0 Тогда
		
		ОбластьФктВремяОРПДВ           = Макет.ПолучитьОбласть("ФктВремяОРПДВ");
		ТабДокумент.Вывести(ОбластьФктВремяОРПДВ);
		ОбластьСотрудникиФктВремяОРПДВ = Макет.ПолучитьОбласть("СотрудникиФктВремяОРПДВ");
		
		Для Каждого Элемент Из МассивФактОРПДВ Цикл
			 ОбластьСотрудникиФктВремяОРПДВ.Параметры.ФИОработникаФактВремяОРПДВ = Элемент.Сотрудник;
			 ОбластьСотрудникиФктВремяОРПДВ.Параметры.ДатаФактВремяОРПДВ         = Формат(Элемент.Дата,"ДФ=dd.MM.yyyy");
			 ОбластьСотрудникиФктВремяОРПДВ.Параметры.ЧасыФактВремяОРПДВ         = Элемент.Часы;
			 ТабДокумент.Вывести(ОбластьСотрудникиФктВремяОРПДВ);
		 КонецЦикла;
		 
	КонецЕсли;
	
	
	
	//Двойной размер оплаты только (все кроме овощеводов)	
	
	
	
	Если МассивФактДР.Количество() > 0 Тогда
		
		ОбластьФактВремяДР             = Макет.ПолучитьОбласть("ФактВремяДР");
		ТабДокумент.Вывести(ОбластьФактВремяДР);
		ОбластьСотрудникиФактВремяДР   = Макет.ПолучитьОбласть("СотрудникиФактВремяДР");
		
		Для Каждого Элемент Из МассивФактДР Цикл
			 ОбластьСотрудникиФактВремяДР.Параметры.ФИОработникаФактВремяДР = Элемент.Сотрудник;
			 ОбластьСотрудникиФактВремяДР.Параметры.ДатаФактВремяДР         = Формат(Элемент.Дата,"ДФ=dd.MM.yyyy");
			 ОбластьСотрудникиФактВремяДР.Параметры.ЧасыФактВремяДР         = Элемент.Часы;
			 ТабДокумент.Вывести(ОбластьСотрудникиФактВремяДР);
		 КонецЦикла;
	КонецЕсли;
	
	//ОбластьПодвал
	
	ОбластьПодвал.Параметры.Дата        = Формат(МассивОбъектов.Дата,"ДФ=MMM.yyyy");
	ОбластьПодвал.Параметры.ДолжностьГД = МассивОбъектов.ДолжностьРуководителя;
	ОбластьПодвал.Параметры.ГД          = МассивОбъектов.Руководитель.Инициалы + " " + МассивОбъектов.Руководитель.Фамилия;
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//ОбластьОзнакомления
	ОбластьОзнакомление.Параметры.ДатаОЗ = Формат(МассивОбъектов.Дата,"ДФ=dd.MM.yyyy");
	ОбластьОзнакомление.Параметры.НомерОЗ = МассивОбъектов.Номер;
	ТабДокумент.Вывести(ОбластьОзнакомление);
		
	ЗапросОЗ = Новый Запрос;
	ЗапросОЗ.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК РаботаВВыходныеИПраздничныеДниСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
		|		ПО РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.Ссылка = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка = &Ссылка";
	
	ЗапросОЗ.УстановитьПараметр("Ссылка",МассивОбъектов);
	РезультатЗапросаОЗ = ЗапросОЗ.Выполнить();
	
	ВыборкаДетальныеЗаписиОЗ = РезультатЗапросаОЗ.Выбрать();
	
	Пока ВыборкаДетальныеЗаписиОЗ.Следующий() Цикл
		 ОбластьСотрудникОЗ.Параметры.ДолжностьОЗ = ВыборкаДетальныеЗаписиОЗ.Должность;
		 ОбластьСотрудникОЗ.Параметры.ФИООЗ       = ВыборкаДетальныеЗаписиОЗ.Сотрудник;
		 ТабДокумент.Вывести(ОбластьСотрудникОЗ);
	КонецЦикла;
		
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

Функция СформироватьПриказОПривлеченииКРаботеВВыходнойДен(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)Экспорт
	
	
	
КонецФункции

функция ПолучитьДолжностьОтветственного(ФизическоеЛицо)

	Запрос = Новый Запрос;
	Запрос.Текст =  
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КадроваяИсторияСотрудниковСрезПоследних.Должность.Наименование КАК ДолжностьНаименование
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";   
		
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	РезультаЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультаЗапроса[0][0];
КонецФункции
Функция ПолучитьСотрудниковИзДокумента(МассивОбъектов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник КАК Сотрудник,
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.Код КАК СотрудникКод,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	РаботаВВыходныеИПраздничныеДниСотрудники.ОтработаноЧасов КАК ОтработаноЧасов,
	|	РаботаВВыходныеИПраздничныеДниСотрудники.СпособКомпенсацииПереработки КАК СпособКомпенсацииПереработки,
	|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение.Наименование КАК Подразделение,
	|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК ПодразделениеСсылка,
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.Наименование КАК СотрудникНаименование
	|ИЗ
	|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК РаботаВВыходныеИПраздничныеДниСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|		ПО РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.Ссылка = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка = &Ссылка
	|	И РаботаВВыходныеИПраздничныеДниСотрудники.ОтработаноЧасов > &Часы
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникНаименование";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если МассивОбъектов.ВремяВЧасах Тогда
		Запрос.УстановитьПараметр("Часы", 0);
	Иначе
		Запрос.УстановитьПараметр("Часы", -1);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;

КонецФункции
Функция ПолучитьСотрудникиТабличнаяЧастьПериод(МассивОбъектов, Сотрудник, ОтработаноЧасов, СпособКомпенсацииПереработки) 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Дата КАК Период
		|ИЗ
		|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК РаботаВВыходныеИПраздничныеДниСотрудники
		|ГДЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник = &Сотрудник
		|	И РаботаВВыходныеИПраздничныеДниСотрудники.ОтработаноЧасов = &ОтработаноЧасов
		|	И РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка = &Регистратор
		|	И РаботаВВыходныеИПраздничныеДниСотрудники.СпособКомпенсацииПереработки = &СпособКомпенсацииПереработки";
		
		Запрос.УстановитьПараметр("Регистратор", МассивОбъектов);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("ОтработаноЧасов", ОтработаноЧасов);
		Запрос.УстановитьПараметр("СпособКомпенсацииПереработки",СпособКомпенсацииПереработки); 
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Возврат РезультатЗапроса;

	КонецФункции
Функция ОпределитьРежимРаботыСотрудников(КолличествоЧасов)
	РежимРаботы = Новый Структура;
	РежимРаботы.Вставить("Перерыв", "12:00-12:45");
	Если КолличествоЧасов = 11 Тогда
		РежимРаботы.Вставить("Режим", "8:30 - 20:30");
		Строка = "12:00 - 12:30
		|16:00 - 16:30"; 
		РежимРаботы.Перерыв =  Строка;
	ИначеЕсли КолличествоЧасов = 8 ИЛИ КолличествоЧасов = 0 Тогда
		РежимРаботы.Вставить("Режим", "8:30 - 17:15");
	ИначеЕсли КолличествоЧасов = 7.2 Тогда
		РежимРаботы.Вставить("Режим", "8:30 - 16:27");
	ИначеЕсли КолличествоЧасов = 7 Тогда
		РежимРаботы.Вставить("Режим", "8:30 - 16:15");
	ИначеЕсли КолличествоЧасов = 6.2 Тогда
		РежимРаботы.Вставить("Режим", "8:30 - 15:27");
	Иначе
		РежимРаботы.Вставить("Режим", "-");
		РежимРаботы.Вставить("Перерыв", "-");
	КонецЕсли;
	Возврат РежимРаботы;
КонецФункции  	
Функция ПолучитьДатуОзнакомления(Дата)
Дата = Дата-24*60*60;
Если ДеньНедели(Дата) > 5 Тогда
	Дата = ПолучитьДатуОзнакомления(Дата);
КонецЕсли;
Возврат Дата;
КонецФункции
Функция ПолучитьДатыРаботы (Регистратор)
	Запрос = новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Дата КАК Дата
		|ИЗ
		|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК РаботаВВыходныеИПраздничныеДниСотрудники
		|ГДЕ
		|	РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Регистратор);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции
Функция ПолучитьРук(Подразделение)
	//Работает, но не так как нужно Кадрам ТКС
	
	//++Орёл П. А. 28.05.2026 в запос добалвено условие - должность в ШР не закрыта 
Руководитель = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ШтатноеРасписание.Должность КАК Должность
				|ИЗ
				|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
				|ГДЕ
				|	ШтатноеРасписание.Подразделение = &Подразделение
				|
				|	И НЕ ШтатноеРасписание.Закрыта
				|
				|УПОРЯДОЧИТЬ ПО
				|	ШтатноеРасписание.ОкладТариф УБЫВ";
Запрос.УстановитьПараметр("Подразделение", Подразделение);
Рез = Запрос.Выполнить().Выгрузить();

Если Рез.Количество() > 0 Тогда
	Руководитель.Вставить("Должность", Рез[0][0]);
 
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
			|ИЗ
			|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
			|ГДЕ
			|	КадроваяИсторияСотрудниковСрезПоследних.Должность = &Должность
			|	И КадроваяИсторияСотрудниковСрезПоследних.Подразделение = &Подразделение
			|
			|УПОРЯДОЧИТЬ ПО
			|	КадроваяИсторияСотрудниковСрезПоследних.Период УБЫВ";
 	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Должность", Руководитель.Должность); 
	Рез = Запрос.Выполнить().Выгрузить(); 
	Если Рез.Количество() > 0 Тогда
		Руководитель.Вставить("Сотрудник",Рез[0][0]);  
	Иначе
		Руководитель.Вставить("Сотрудник","");
	КонецЕсли;

КонецЕсли;
возврат Руководитель;
КонецФункции
Функция ПолучитьДанныеПоДолжности(Должность, Организация)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	 |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	 |	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо.Инициалы + КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо.Фамилия КАК Сотрудник
	 |ИЗ
	 |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	 |ГДЕ
	 |	КадроваяИсторияСотрудниковСрезПоследних.Организация = &Организация
	 |	И КадроваяИсторияСотрудниковСрезПоследних.Должность.Наименование = &Должность" ;
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса[0];
КонецФункции
функция ПолучитьСотрудниковДляОзнакомления(МассивОбъектов) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.ФизическоеЛицо.Инициалы КАК Инициалы,
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.ФизическоеЛицо.Фамилия КАК Фамилия,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение.Наименование КАК Подразделение
	|ИЗ
	|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК РаботаВВыходныеИПраздничныеДниСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|		ПО РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.Ссылка = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	возврат РезультатЗапроса;
КонецФункции
функция ПолучитьРукЮРОтдела(ТекущийРуководитель)

	Запрос = Новый Запрос;
	Запрос.Текст =    "ВЫБРАТЬ
		|	СтруктураПредприятия.ТекущийРуководитель КАК ТекущийРуководитель
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Наименование ПОДОБНО ""Отдел по правовым%""		
		|	И СтруктураПредприятия.Родитель.Родитель.ТекущийРуководитель = &ТекущийРуководитель";  
	
	Запрос.УстановитьПараметр("ТекущийРуководитель", ТекущийРуководитель);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса[0][0];
		
	
КонецФункции








	


